In [1]:
import numpy as np
import pandas as pd

In [4]:
data = np.array([["uBiome", 100], ["Globant", 200]])

In [33]:
df_columns = ["Company", "Total Workers"]

In [34]:
data

array([['uBiome', '100'],
       ['Globant', '200']], dtype='<U7')

In [45]:
df = pd.DataFrame(data=data, columns=df_columns)

In [46]:
len(df)

2

In [47]:
type(df)

pandas.core.frame.DataFrame

In [48]:
df["HQs"] = ["San Francisco", "Buenos Aires"]
df

   Company Total Workers            HQs
0   uBiome           100  San Francisco
1  Globant           200   Buenos Aires

In [54]:
# Broadcasting, Agregar una columna con un nuevo valor
df["TechCompany?"] = True
df

   Company Total Workers            HQs  TechCompany?
0   uBiome           100  San Francisco          True
1  Globant           200   Buenos Aires          True

In [60]:
data2 = np.array([["MyCompany", 400]])
data2

array([['MyCompany', '400']], dtype='<U9')

In [61]:
df2_columns = ["Company", "Total Workers"]
df2_columns

['Company', 'Total Workers']

In [63]:
df2 = pd.DataFrame(data=data2, columns=df2_columns)
df2

     Company Total Workers
0  MyCompany           400

In [76]:
df3 = pd.concat([df, df2])
df3

/Users/ec/.virtualenvs/pandas/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     Company            HQs TechCompany? Total Workers
0     uBiome  San Francisco         True           100
1    Globant   Buenos Aires         True           200
0  MyCompany            NaN          NaN           400

In [79]:
# Para evitar un error con los indices duplicados reseteamos los indices
df3.reset_index(inplace=True)
df3 # imprimira el historial de las columnas index_* la cantidad de veces que se ha reseteado la columna

   level_0  index    Company            HQs TechCompany? Total Workers
0        0      0     uBiome  San Francisco         True           100
1        1      1    Globant   Buenos Aires         True           200
2        2      0  MyCompany            NaN          NaN           400

In [80]:
# Remove columns, index_*
df3.drop(columns = ["level_0", "index"], inplace=True)

In [81]:
df3

     Company            HQs TechCompany? Total Workers
0     uBiome  San Francisco         True           100
1    Globant   Buenos Aires         True           200
2  MyCompany            NaN          NaN           400